#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
科目名称别名映射表
"""

ACCOUNT_ALIASES = {
        # ========== 资产负债表 ==========
        '应付职工薪酬': ['应付工资', '应付职工工资'],
        '应交税费': ['应交税金', '未交税费', '未交税金'],
        '预付款项': ['预付账款', '预付帐款'],
        '预收款项': ['预收账款', '预收帐款'],
        '其他应付款': ['其他应交款'],
        '一年内到期的非流动资产': ['一年内到期的长期债权投资'],
        '一年内到期的非流动负债': ['一年内到期的长期负债'],
        '固定资产原价': ['固定资产原值'],
        '固定资产净额': ['固定资产账面价值'],
        '交易性金融资产': ['短期投资'],
        '其他应收款': ['应收补贴款', '其它应收款'],
        '长期投资合计': ['长期投资'],
        '盈余公积': ['法定公益金'],
        '少数股东权益': ['少数所有者权益'],
        '实收资本（股本）': ['实收资本（或股本）', '股本', '实收资本（或股本）净额', '股本净额', '实收资本净额'],
        '应收账款': ['应收帐款'],
        '应付账款': ['应付帐款'],
        '负债合计': ['负债总计'],
        '所有者权益（或股东权益）合计': ['所有者权益（或股东权益）合计', '股东权益合计', '所有者权益合计'],
        '负债和所有者权益（或股东权益）总计': ['负债和所有者权益（或股东权益）总计', '负债和所有者权益总计', '负债和股东权益总计', '负债和所有者合计'],
        '递延所得税资产': ['递延税款借项'],
        '递延所得税负债': ['递延税款贷项'],
        '专项储备': ['专项存储'],
        '存货': ['存货合计'],
        '无形资产': ['无形资产净值'],
        '资产总计': ['资产合计'],
        
        # ========== 利润表 ==========
        # 新旧会计准则科目名称差异
        '营业总收入': ['营业收入','主营业务收入', '产品销售收入','商品销售收入'],
        '营业总成本': ['营业成本费用合计', '营业成本及费用合计', '营业总支出'],
        '营业成本': ['主营业务成本', '商品销售成本', '减主营业务成本'],
        '税金及附加': ['主营业务税金及附加', '营业税金及附加', '商品销售税金及附加'],
        '所得税费用': ['所得税', '减所得税', '应交所得税'],
        '营业外收入': [],
        '少数股东损益': ['少数股东权益', '少数股东本期收益'],
        '利息收入': ['财务费用利息收入'],
        '研发费用': ['研发支出'],
        '销售费用':['营业费用'],
        '净利润':['税后利润'],
        
        # ========== 现金流量表 ==========
        # 不同表述方式
        '取得借款收到的现金': ['借款所收到的现金', '借款收到的现金', '取得借款所收到的现金'],
        '支付其他与经营活动有关的现金': ['支付的其他与经营活动有关的现金'],
        '收到的其他与经营活动有关的现金': ['收到其他与经营活动有关的现金'],
        '收到的其他与投资活动有关的现金': ['收到其他与投资活动有关的现金'],
        '支付其他与投资活动有关的现金': ['支付的其他与投资活动有关的现金'],
        '收到的其他与筹资活动有关的现金': ['收到其他与筹资活动有关的现金'],
        '支付其他与筹资活动有关的现金': ['支付的其他与筹资活动有关的现金'],
        '支付给职工以及为职工支付的现金': ['支付给职工及为职工支付的现金', '支付职工薪酬'],
        '汇率变动对现金及现金等价物的影响': ['汇率变动对现金的影响', '汇率变动对现金的影响额'],
        '购建固定资产、无形资产和其他长期资产所支付的现金': ['购建固定资产、无形资产等支付的现金'],
        '投资支付的现金': ['投资所支付的现金'],
        '偿还债务支付的现金': ['偿还债务所支付的现金'],
        '吸收投资收到的现金': ['吸收投资所收到的现金'],
        '收回投资收到的现金': ['收回投资所收到的现金'],
        '支付的各项税费': ['支付税费'],
        '现金及现金等价物净增加额': ['现金净增加额'],
        '期初现金及现金等价物余额': ['期初现金余额'],
        '期末现金及现金等价物余额': ['期末现金余额'],
    }
